leetLanguage = {
    'A':['λ', '@', '/\\', '/-\\', '?', '^', '4', 'α'],
    'B':['ß', '|3', '8', 'l³', '13', 'I3', 'J3'],
    'C':['(', '[', '<', '©', '¢'],
    'D':['đ', '|]', 'Ð', '', '1)'],
    'E':['ε', '€', '&', '£', '3'],
    'F':['ƒ', '|*|-|', '|”', '|=', 'l²'],
    'G':['6', '&', '9'],
    'H':['|-|', '4', '#', '}{', ']-[', '/-/', ')-('],
    'I':['!', '1', '|', '][', 'ỉ'],
    'J':['_|', '¿'],
    'K':['|<', '|{', '|(', 'X'],
    'L':['|_', '1', '£', '|', '][_'],
    'M':['|V|', '/\\/\\', '/v\\', ']V[', '|\\/|', 'AA', '[]V[]', '|11', '/|\\', '^^', '(V)', '|Y|', '!\\/!'],
    'N':['|\\|', '/\\/', '/V', '|V', '/\\/', '|1', '2', '?', '(\\)', '11', 'r', '!\\!'],
    'O':['0'],
    'P':['l³', '9', '()', '[]', '*', '°', '<>', 'ø', '{[]}'],
    'Q':['0_', '|°', 'p', '|>', '|*', '[]D', '][D', '|²', '|?', '|D'],
    'R':['я', '0', ''],
    'S':['§', '|2', '1²', '®', '?', 'я', '12', '.-'],
    'T':['†', '$', '', '?', 'ŝ', 'ş'],
    'U':['µ', '+', '', '|'],
    'V':['\\/', '|_|', '[_]', 'v'],
    'W':['VV', '|/', '\\| '],
    'X':['><', '', '\\A/', "'", 'uu', '\\^/', '\\|/', 'uJ'],
    'Y':['¥', '`/', '}{', '%', ']['],
    'Z':['z', '¥'],
}

array = []

def leetTranslate(string: str) -> str:
    result = ''

    for letter in string:
        if letter.upper() in leetLanguage:
            result += leetLanguage[letter.upper()][0]
            array.append(leetLanguage[letter.upper()][0])
        else:
            result += letter
            array.append(letter)
    return result


print(leetTranslate('Escribe un programa que reciba un texto y transforme lenguaje natural'))

def leetToHumanTranslate(string: str) -> str:
    result = ''
